Revit 2026 API

# ExternalResourceTypes Class

---

Provides a container of all Revit built-in ExternalResourceType instances.

SystemObject Autodesk.Revit.DBExternalResourceTypes

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ExternalResourceTypes
```
```vb
Public NotInheritable Class ExternalResourceTypes
```
```cpp
public ref class ExternalResourceTypes abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalResourceTypes = class end
```

#### Reference

Autodesk.Revit.DB Namespace